<?php
namespace GaNuongLaChanh\FlarumVnSlug;


use Cocur\Slugify\Slugify;

class Utils {
	public static $MY_RULE = [

		/* Vietnamese */
		'ạ' => 'a',
		'á' => 'a',
		'à' => 'a',
		'ả' => 'a',
		'ã' => 'a',

		'â' => 'a',
		'ầ' => 'a',
		'ấ' => 'a',
		'ậ' => 'a',
		'ẩ' => 'a',
		'ẫ' => 'a',

		'ă' => 'a',
		'ằ' => 'a',
		'ắ' => 'a',
		'ặ' => 'a',
		'ẳ' => 'a',
		'ẵ' => 'a',

		'ẹ' => 'e',
		'è' => 'e',
		'é' => 'e',
		'ẽ' => 'e',
		'ẻ' => 'e',

		'ê' => 'e',
		'ề' => 'e',
		'ế' => 'e',
		'ệ' => 'e',
		'ể' => 'e',
		'ễ' => 'e',

		'ị' => 'i',
		'ỉ' => 'i',
		'í' => 'i',
		'ì' => 'i',
		'ĩ' => 'i',

		'ò' => 'o',
		'ó' => 'o',
		'õ' => 'o',
		'ọ' => 'o',
		'ỏ' => 'o',

		'ô' => 'o',
		'ồ' => 'o',
		'ố' => 'o',
		'ộ' => 'o',
		'ổ' => 'o',
		'ỗ' => 'o',

		'ơ' => 'o',
		'ờ' => 'o',
		'ớ' => 'o',
		'ợ' => 'o',
		'ở' => 'o',
		'ỡ' => 'o',

		'ù' => 'u',
		'ú' => 'u',
		'ụ' => 'u',
		'ũ' => 'u',
		'ủ' => 'u',

		'ư' => 'u',
		'ừ' => 'u',
		'ứ' => 'u',
		'ự' => 'u',
		'ử' => 'u',
		'ữ' => 'u',

		'ỳ' => 'y',
		'ý' => 'y',
		'ỵ' => 'y',
		'ỷ' => 'y',
		'ỹ' => 'y',

		"Ạ" => "a",
		"Á" => "a",
		"À" => "a",
		"Ả" => "a",
		"Ã" => "a",
		"Â" => "a",
		"Ầ" => "a",
		"Ấ" => "a",
		"Ậ" => "a",
		"Ẩ" => "a",
		"Ẫ" => "a",
		"Ă" => "a",
		"Ằ" => "a",
		"Ắ" => "a",
		"Ặ" => "a",
		"Ẳ" => "a",
		"Ẵ" => "a",
		"Ẹ" => "e",
		"È" => "e",
		"É" => "e",
		"Ẽ" => "e",
		"Ẻ" => "e",
		"Ê" => "e",
		"Ề" => "e",
		"Ế" => "e",
		"Ệ" => "e",
		"Ể" => "e",
		"Ễ" => "e",
		"Ị" => "i",
		"Ỉ" => "i",
		"Í" => "i",
		"Ì" => "i",
		"Ĩ" => "i",
		"Ò" => "o",
		"Ó" => "o",
		"Õ" => "o",
		"Ọ" => "o",
		"Ỏ" => "o",
		"Ô" => "o",
		"Ồ" => "o",
		"Ố" => "o",
		"Ộ" => "o",
		"Ổ" => "o",
		"Ỗ" => "o",
		"Ơ" => "o",
		"Ờ" => "o",
		"Ớ" => "o",
		"Ợ" => "o",
		"Ở" => "o",
		"Ỡ" => "o",
		"Ù" => "u",
		"Ú" => "u",
		"Ụ" => "u",
		"Ũ" => "u",
		"Ủ" => "u",
		"Ư" => "u",
		"Ừ" => "u",
		"Ứ" => "u",
		"Ự" => "u",
		"Ử" => "u",
		"Ữ" => "u",
		"Ỳ" => "y",
		"Ý" => "y",
		"Ỵ" => "y",
		"Ỷ" => "y",
		"Ỹ" => "y",
	];

	/**
	 * @param $string
	 * @return string
	 */
	public static function genSlug($string)
	{
		$slug_engine = new Slugify();
		$slug_engine->addRules(self::$MY_RULE);
		$slug_engine->addRule('#', '-sharp-');
		$slug_engine->addRule('+', '-plus-');
		return $slug_engine->slugify($string);
	}
}
